[
  {
    "id": 1,
    "name": "Kasa",
    "link": "https://maliksynt-kasa.vercel.app/",
    "github": "https://github.com/maliksynt/Kasa",
    "cover": "/images/Kasa/CoverImage.jpg",
    "video": "/videos/montagne.webm",
    "videomp4": "/videos/montagne.mp4",
    "photos": [
      "/images/Kasa/FullScreen.jpeg",
      "/images/Kasa/Photo1.jpg",
      "/images/Kasa/Mobile.jpeg",
      "/images/Kasa/Covv.jpg",
      "/images/Kasa/appart.jpg"
    ],
    "description": [
      "Kasa is an application for renting accommodations between individuals. It allows property owners to list their real estate for rent and tenants to find a place to rent.",
      "The application consists of 3 pages: the homepage, the about page, and the detail page of a property. The application is responsive and was built using React with the assistance of SASS.",
      "This project introduced me to the React framework and helped me understand how components, routes, and hooks work, particularly useState and useRef."
    ],
    "technologies": ["React", "SASS"],
    "features": ["Routing", "display details of a property"],
    "homepage": true
  },
  {
    "id": 2,
    "name": "Mon Vieux Grimoire",
    "link": null,
    "github": "https://github.com/maliksynt/Mon-Vieux-Grimoire",
    "cover": "/images/MonVieuxGrimoire/Cover.jpg",
    "video": "/videos/aurore.webm",
    "videomp4": "/videos/aurore.mp4",
    "photos": [
      "/images/MonVieuxGrimoire/allScreen.jpeg",
      "/images/MonVieuxGrimoire/book.jpg",
      "/images/MonVieuxGrimoire/phone.jpeg",
      "/images/MonVieuxGrimoire/ref.jpg"
    ],
    "description": [
      "Mon Vieux grimoire is a book listing and rating website: It allows sellers to list their books for sale and buyers to find them.",
      "The site consists of 3 pages: the homepage, the login page, and the detail page of a book. Users can browse books for sale, rate them, and see the highest-rated books on average. They can also add a book for sale. The login is secured with JWT, and the password is hashed with bcrypt.",
      "This project allowed me to discover backend development with Express and MongoDB. I learned how to create routes, handle requests and responses, and manipulate a NoSQL database."
    ],
    "technologies": ["Node.js", "Express", "MongoDB"],
    "features": [
      "CRUD",
      "Authentification",
      "Image optimization (multer)",
      "Password hashing (bcrypt)",
      "Token generation (JWT)"
    ],
    "homepage": true
  },
  {
    "id": 3,
    "name": "Google Ads Partner",
    "link": "https://alexismarketeur.com/",
    "github": "https://github.com/maliksynt/marketingPage",
    "cover": "/images/AlexisRodrigues/Cover.jpg",
    "video": "/videos/avion.webm",
    "videomp4": "/videos/avion.mp4",
    "photos": [
      "/images/AlexisRodrigues/0.jpg",
      "/images/AlexisRodrigues/1.jpg",
      "/images/AlexisRodrigues/4.png",
      "/images/AlexisRodrigues/3.jpg",
      "/images/AlexisRodrigues/2.png",
      "/images/AlexisRodrigues/5.png",
      "/images/AlexisRodrigues/6.jpg",
      "/images/AlexisRodrigues/7.png",
      "/images/AlexisRodrigues/8.jpg",
      "/images/AlexisRodrigues/9.jpg",
      "/images/AlexisRodrigues/10.jpg"
    ],
    "description": [
      "I designed and deployed a landing page for a freelance Google Ads expert, intended to enhance client acquisition through strategic design and functionality. Beginning with comprehensive wireframes, the process extended through to the final deployment of a visually striking and highly functional site.",
      "The focus of the design was on user engagement and conversion, utilizing a simple color palette and bold typography to ensure visibility without overwhelming users. I employed pure CSS and integrated Aceternity UI for dynamic animations, enhancing interaction and retaining user interest. Strategic positioning of Calls-to-Action and adept layout design were central to converting visitors into clients, ultimately aiding in the successful launch of the client’s business.",
      "This project significantly advanced my skills in several areas; SEO techniques were refined to boost the site's visibility, UX/UI design principles were applied to optimize user experience, and my proficiency with CSS animations was expanded. It offered a practical experience that not only contributed to my technical skills but also deepened my understanding of how to effectively engage and convert site visitors in a competitive digital landscape."
    ],
    "technologies": ["NextJS", "TailwindCSS", "UX/UI"],
    "features": [
      "SEO optimization",
      "Shadcn UI to style components",
      "Aceternity UI for animated components",
      "UX/UI design with Figma"
    ],
    "homepage": true
  }
]
